name: "NaiveNet"
force_backward: true
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 256 dim: 13 dim: 13 } }
  
}
 
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "data"
  top: "pool5"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}
